Core/src/Documents/AzRyДоговор/AzRyДоговор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AzRyДоговор</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасходСоСчета</types>
      <types>EnumRef.AzRyВидыОперацийКонвертацияВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поступлено</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Юрист</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудит</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Директор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПроекта</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектыВерсия</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСуммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куриер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныеУсловия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныеУсловияДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныеУсловияТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходКПоддержке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходКПоддержкеДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходКПоддержкеТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходВУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходВУслугиДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходВУслугиТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретениеИзСвоейКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретениеИзСвоейКомпанииНаимОрг</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретениеИзСвоейКомпанииДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДоговорТипПродажи</name>
    <type>
      <types>EnumRef.AzRyДоговорТипПродажи</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительНаправления</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Условия</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Деиствие</name>
      <type>
        <types>CatalogRef.AzRyДеиствие</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоговора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипПродажи</name>
    <attributes>
      <name>И</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСоглашения</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПродажи</name>
      <type>
        <types>EnumRef.AzRyДоговорТипПродажи</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйЗаПроизводство</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйЗаСписаниеЗапасов</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьСписаниеЗапасов</name>
      <type>
        <types>EnumRef.AzRyДоговорПериодичностьСписаниеЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>Коментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Documents/AzRyДоговор/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ბეჭდვა)
	Макет = Документы.AzRyДоговор.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	AzRyДоговор.Проект КАК проект,
	|	AzRyДоговор.ПроектыВерсия КАК проектверсия,
	|	AzRyДоговор.Организация КАК организация,
	|	AzRyДоговор.Контрагент КАК контрагент,
	|	AzRyДоговор.ДокументДоговора КАК объектдоговора,
	|	AzRyДоговор.Дата КАК дата,
	|	AzRyДоговор.МенеджерПроекта КАК менеджер,
	|	AzRyДоговор.Юрист КАК юрист,
	|	AzRyДоговор.Аудит КАК аудит,
	|	AzRyДоговор.Директор КАК директор,
	|	AzRyДоговор.Условия.(
	|		Дата КАК дата,
	|		Деиствие КАК событие,
	|		СтатьяДоговора КАК статья,
	|		Комментарий КАК коментарий,
	|		Ответственный КАК ответственный
	|	),
	|	AzRyДоговор.Сумма КАК сумма,
	|	AzRyДоговор.ТекстСуммы КАК текстСуммы,
	|	AzRyДоговор.ДатаДоговора КАК датадоговора,
	|	AzRyДоговор.Куриер КАК куриер,
	|	AzRyДоговор.ВалютаДокумента КАК валюта,
	|	AzRyДоговор.ГарантийныеУсловия,
	|	AzRyДоговор.ГарантийныеУсловияДатаОкончания,
	|	AzRyДоговор.ГарантийныеУсловияТекст,
	|	AzRyДоговор.ПереходКПоддержке,
	|	AzRyДоговор.ПереходКПоддержкеДатаОкончания,
	|	AzRyДоговор.ПереходКПоддержкеТекст,
	|	AzRyДоговор.ПереходВУслуги,
	|	AzRyДоговор.ПереходВУслугиДатаОкончания,
	|	AzRyДоговор.ПереходВУслугиТекст,
	|	AzRyДоговор.ПриобретениеИзСвоейКомпании,
	|	AzRyДоговор.ПриобретениеИзСвоейКомпанииНаимОрг,
	|	AzRyДоговор.ПриобретениеИзСвоейКомпанииДоговор,
	|	AzRyДоговор.ТипПродажи.(
	|		Ссылка,
	|		НомерСтроки,
	|		ТипПродажи.И,
	|		ПредметСоглашения,
	|		ТипПродажи,
	|		Количество,
	|		Цена,
	|		Валюта,
	|		ОтветственныйЗаПроизводство,
	|		Спецификация,
	|		ПериодичностьСписаниеЗапасов,
	|		Коментарий
	|	),
	|	AzRyДоговор.РуководительНаправления КАК РуководительНаправления
	|ИЗ
	|	Документ.AzRyДоговор КАК AzRyДоговор
	|ГДЕ
	|	AzRyДоговор.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТипПродажи = Макет.ПолучитьОбласть("ТипПродажи");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьУсловия = Макет.ПолучитьОбласть("Условия");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	
		ОбластьШапка.Параметры.Заполнить(Выборка);
		ОбластьШапка.Параметры.валюта2 = Константы.ВалютаУчета.Получить();		
		СтрПарам = ПолучитьКурсВалюты(Выборка.дата, Выборка.валюта);
		ОбластьШапка.Параметры.сумма2 = Выборка.сумма * (СтрПарам.Курс / СтрПарам.Кратность); 
		ТабДок.Вывести(ОбластьШапка);
		
		ВыборкаТипПродажи = Выборка.ТипПродажи.Выбрать();
		Пока ВыборкаТипПродажи.Следующий() Цикл
			ОбластьТипПродажи.Параметры.Заполнить(ВыборкаТипПродажи);
			ТабДок.Вывести(ОбластьТипПродажи, Выборка.Уровень());
		КонецЦикла;
	
		ОбластьПодвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьПодвал, Выборка.Уровень());
		
		//ТабДок.Вывести(ОбластьУсловияШапка);
		ВыборкаУсловия = Выборка.Условия.Выбрать();
		Пока ВыборкаУсловия.Следующий() Цикл
			ОбластьУсловия.Параметры.Заполнить(ВыборкаУсловия);
			ТабДок.Вывести(ОбластьУсловия, ВыборкаУсловия.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалюты(Дата, ВалютаДокумента)

	СтрПарам = Новый Структура;
	
	ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаДокумента));
	
	СтрПарам.Вставить("Курс", ?(ВалютаРасчетовКурсКратность.Курс = 0, 0, ВалютаРасчетовКурсКратность.Курс));
	СтрПарам.Вставить("Кратность", ?(ВалютаРасчетовКурсКратность.Кратность = 0, 0, ВалютаРасчетовКурсКратность.Кратность));
	
	Возврат СтрПарам;
	
КонецФункции
